In [1]:
import pandas as pd
import os
import numpy as np

In [2]:
def fn(path):       # 1.Get file names from directory
    file_list=os.listdir(path)
    return file_list

In [3]:
ag = pd.DataFrame({})
for file in fn("../../raw_data/tudo/"):
    print(file)
    df = pd.read_csv("../../raw_data/tudo/"+file)
    if list(ag.columns):
        ag = pd.concat([ag,df],axis=1)
    else:
        ag = df

bee.csv
cmo.csv
ear.csv
ena.csv

In [4]:
ag = pd.read_csv("../../raw_data/tudo/"+"bee.csv")

In [5]:
ag = ag.drop("Unnamed: 0",axis=1)

In [6]:
ag

            Date     Price  change
0     2022-09-09  82203.99   -0.10
1     2022-09-08  82291.74    0.09
2     2022-09-06  82216.49   -1.30
3     2022-09-05  83314.13    0.40
4     2022-09-02  82985.23   -0.30
...          ...       ...     ...
4373  2005-01-07   6623.89    1.73
4374  2005-01-06   6511.44   -0.80
4375  2005-01-05   6569.65   -0.30
4376  2005-01-04   6594.56   -3.70
4377  2005-01-03   6848.30   -1.40

[4378 rows x 3 columns]

In [7]:
df2= pd.read_csv("../../raw_data/tudo/"+"cmo.csv")

In [8]:
df2

    din_instante        cmo
0     2005-01-07   1.024512
1     2005-01-14   7.621400
2     2005-01-21   1.773359
3     2005-01-28   1.505705
4     2005-02-04   0.540765
..           ...        ...
919   2022-08-19  70.648587
920   2022-08-26  51.648967
921   2022-09-02  50.188996
922   2022-09-09  36.979260
923   2022-09-16  44.279114

[924 rows x 2 columns]

In [9]:
ag = ag.merge(df2, left_on='Date', right_on='din_instante')

In [10]:
ag = ag.drop("din_instante",axis=1)

In [11]:
ag

           Date     Price  change        cmo
0    2022-09-09  82203.99   -0.10  36.979260
1    2022-09-02  82985.23   -0.30  50.188996
2    2022-08-26  82117.59   -1.00  51.648967
3    2022-08-19  84655.69   -0.80  70.648587
4    2022-08-12  84029.98    1.61  91.118178
..          ...       ...     ...        ...
862  2005-02-04   7151.01    4.76   0.540765
863  2005-01-28   6408.02   -1.00   1.505705
864  2005-01-21   6407.45    1.40   1.773359
865  2005-01-14   6660.59   -0.30   7.621400
866  2005-01-07   6623.89    1.73   1.024512

[867 rows x 4 columns]

In [12]:
df2= pd.read_csv("../../raw_data/tudo/"+"ear.csv")

In [13]:
ag = ag.merge(df2, left_on='Date', right_on='ear_data')

In [14]:
ag = ag.drop("ear_data",axis=1)

In [15]:
df2= pd.read_csv("../../raw_data/tudo/"+"ena.csv")

In [16]:
ag = ag.merge(df2, left_on='Date', right_on='ena_data')

In [17]:
ag = ag.drop("ena_data",axis=1)

In [18]:
ag

           Date     Price  change        cmo           ear           ena
0    2022-09-09  82203.99   -0.10  36.979260  71955.164139   9453.021976
1    2022-09-02  82985.23   -0.30  50.188996  73752.576613   9475.869196
2    2022-08-26  82117.59   -1.00  51.648967  75385.035439  11857.232780
3    2022-08-19  84655.69   -0.80  70.648587  76639.664832  14461.811972
4    2022-08-12  84029.98    1.61  91.118178  77767.381265  12490.554733
..          ...       ...     ...        ...           ...           ...
862  2005-02-04   7151.01    4.76   0.540765  85413.644060  31455.526910
863  2005-01-28   6408.02   -1.00   1.505705  82862.298830  31140.877380
864  2005-01-21   6407.45    1.40   1.773359  80474.873130  37984.065060
865  2005-01-14   6660.59   -0.30   7.621400  76597.962680  29017.435700
866  2005-01-07   6623.89    1.73   1.024512  73891.868390  29144.705850

[867 rows x 6 columns]

In [19]:
salvo = ag.copy()

In [20]:
ag.to_csv("../../data/final/final.csv")

In [21]:
df2= pd.read_csv("../../raw_data/quant/"+"train.csv")

In [22]:
df2["DT_COMPTC"] = pd.to_datetime(df2["DT_COMPTC"])

In [23]:
ag["Date"] = pd.to_datetime(ag["Date"])

In [24]:
ag.dtypes

Date      datetime64[ns]
Price            float64
change           float64
cmo              float64
ear              float64
ena              float64
dtype: object

In [25]:
ag = ag.merge(df2, left_on='Date', right_on='DT_COMPTC')

In [26]:
ag.to_csv("../../data/final/final2.csv")